#### Student’s Full Name: Anmol Tripathi
#### Course Title: SQL/NoSQL Databases for Data and Information Sciences
#### Term name and year: Fall 2023
#### Submission Week: 6
#### Instructor’s Name: Nayem Rahman
#### Date of Submission : 04/10/2023

In [1]:
import sqlite3
import pandas as pd

#### Using the MySQL Workbench, create a database called Worker. The database must be named “Worker”.

In [2]:
Worker = "Worker.db"

In [3]:
conn = sqlite3.connect(Worker)

In [4]:
conn = sqlite3.connect('/Users/HP/OneDrive/Desktop/SQL/Worker.db')

In [5]:
%load_ext sql

In [6]:
%load_ext sql


%sql sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

#### 1. Write a query to display the unique TrainerFirstName from the Trainer table. Sort the results. Make sure you show the print screen of the complete set of the rows and columns.

In [16]:
%%sql

SELECT DISTINCT TrainerFirstName
FROM Trainer
ORDER BY TrainerFirstName;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[('Avinash',),
 ('James',),
 ('John',),
 ('Johnny',),
 ('Jordan',),
 ('Kathy',),
 ('Maria',),
 ('Mary',),
 ('Michael',),
 ('Mike',),
 ('Paul',),
 ('Robert',),
 ('Vanessa',)]

#### 2. Write a query to display FirstName, LastName, and HireDate of employees with HireDate greater than January 11, 2011. Sort the results by HireDate. Make sure you show the print screen of the complete set of the rows and columns.

In [17]:
%%sql

SELECT FirstName, LastName, HireDate
FROM Employee
WHERE HireDate > '2011-01-11'
ORDER BY HireDate;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[('Kathy', 'Cooper', '2011-11-18'),
 ('Nola', 'Davis', '2016-03-23'),
 ('John', 'Wilson', '2017-03-19')]

#### 3. Write a query to display FirstName, LastName, and HireDate of employees hired between January 11, 2005, and January 11, 2011. Sort the results by HireDate. Make sure you show the print screen of the complete set of the rows and columns.

In [18]:
%%sql

SELECT FirstName, LastName, HireDate
FROM Employee
WHERE HireDate BETWEEN '2005-01-11' AND '2011-01-11'
ORDER BY HireDate;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[('Tom', 'Harper', '2010-04-11')]

#### 4. Write a query to display the FirstName, LastName, DepartmentId from the Employee table. Sort the output by DepartmentID and LastName. Make sure you show the print screen of the complete set of the rows and columns.

In [19]:
%%sql

SELECT FirstName, LastName, DepartmentID
FROM Employee
ORDER BY DepartmentID, LastName;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[('John', 'Wilson', 1),
 ('Andy', 'Wong', 2),
 ('Vivek', 'Pandey', 3),
 ('Nola', 'Davis', 7),
 ('Kathy', 'Cooper', 8),
 ('Tom', 'Harper', 9)]

#### 5. Write a query to display the EquipmentID, EquipmentName, and EquipmentCostAmount increase by 15% expressed as a whole number. Label the column NewEquipmentCost. Sort the results by EquipmentID. Make sure you show the print screen of the complete set of the rows and columns.

In [26]:
%%sql

SELECT EquipmentID, EquipmentName, EquipmentCostAmount AS OriginalEquipmentCost, ROUND(EquipmentCostAmount * 1.15) AS EquipmentCostIncrease
FROM Equipment
ORDER BY EquipmentID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[(1, 'Notebook Computers', 1000, 1150.0),
 (2, 'Headsets', 200, 230.0),
 (3, 'Computer Monitor', 1500, 1725.0),
 (4, 'Multi-Function Printers', 800, 920.0),
 (5, 'Projector or a Big Screen TV', 600, 690.0),
 (6, 'Servers', 300, 345.0),
 (7, 'Internet Modem', 250, 288.0),
 (8, 'Cell Phone', 1200, 1380.0)]

#### 6. Write a query to display the FirstName, LastName, HireDate, and Year on which the employee started (Employee table). Sort the results by Year and LastName. Make sure you show the print screen of the complete set of the rows and columns.

In [21]:
%%sql

SELECT FirstName, LastName, HireDate, STRFTIME('%Y', HireDate) AS Year
FROM Employee
ORDER BY Year, LastName;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[('Andy', 'Wong', '2001-01-15', '2001'),
 ('Vivek', 'Pandey', '2003-11-15', '2003'),
 ('Tom', 'Harper', '2010-04-11', '2010'),
 ('Kathy', 'Cooper', '2011-11-18', '2011'),
 ('Nola', 'Davis', '2016-03-23', '2016'),
 ('John', 'Wilson', '2017-03-19', '2017')]

#### 7. Write a query to display the FirstName, LastName, HireDate from the Employee table. Sort the data in descending order of HireDate. Make sure you show the print screen of the complete set of the rows and columns.

In [22]:
%%sql

SELECT FirstName, LastName, HireDate
FROM Employee
ORDER BY HireDate DESC;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[('John', 'Wilson', '2017-03-19'),
 ('Nola', 'Davis', '2016-03-23'),
 ('Kathy', 'Cooper', '2011-11-18'),
 ('Tom', 'Harper', '2010-04-11'),
 ('Vivek', 'Pandey', '2003-11-15'),
 ('Andy', 'Wong', '2001-01-15')]

#### 8. Write a query to display all columns from the employee table for an employee who joined the company first and without using any hard-coded filter. Make sure you show the print screen of the row and all columns.

In [23]:
%%sql

SELECT *
FROM Employee
WHERE HireDate = (SELECT MIN(HireDate) FROM Employee);

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[(1, 2, 'Andy', 'Wong', '345 South Street', '(603) 555-6880', '2001-01-15')]

#### 9. Write a query to display the minimum and maximum HireDate for each Department (hints: DepartmentID) (Employee table). Make sure you show the print screen of the complete set of the rows and columns.

In [29]:
%%sql

SELECT
 d.DepartmentID,
 d.DepartmentNm,
 MIN(e.HireDate) AS MinHireDate,
 MAX(e.HireDate) AS MaxHireDate
FROM
 Employee e
JOIN
 Department d ON e.DepartmentID = d.DepartmentID
GROUP BY
 d.DepartmentID, d.DepartmentNm
ORDER BY
 d.DepartmentID;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[(1, 'Research & Development', '2017-03-19', '2017-03-19'),
 (2, 'Production', '2001-01-15', '2001-01-15'),
 (3, 'IT Support', '2003-11-15', '2003-11-15'),
 (7, 'Sales & Marketing', '2016-03-23', '2016-03-23'),
 (8, 'Human Resource Management', '2011-11-18', '2011-11-18'),
 (9, 'Accounting and Finance', '2010-04-11', '2010-04-11')]

#### 10. Write a query to display the number of trainers for each training course. Source tables: Training and Trainer. Sort the results by TrainingName. Make sure you show the print screen of the complete set of the rows and columns.

In [25]:
%%sql

SELECT T.TrainingName, COUNT(TrainerID) AS NumTrainers
FROM Training T
LEFT JOIN Trainer TR ON T.TrainingID = TR.TrainingID
GROUP BY T.TrainingName
ORDER BY T.TrainingName;

 * sqlite:////Users/HP/OneDrive/Desktop/SQL/Worker.db
Done.

[('COVID-19 Awareness and Protection Training', 2),
 ('Code of Conduct Training', 1),
 ('Employee Relations', 2),
 ('Intro to Python', 2),
 ('Machine Learning', 2),
 ('Microsoft Certifications', 1),
 ('Product Knowledge', 1),
 ('Safety Training', 1),
 ('Sales Skills', 1),
 ('Security and Privacy', 1),
 ('Travel and Expense Management', 2)]